run/BM3/BM3_RadiationOnly/0/alpha.fluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.fluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0]; // kg m s K mol A cd

internalField   uniform 0; // initially only air is in the domain

boundaryField
{

    inletWall
    {
	type            fixedValue;
	value	        uniform 1;  // fluid enters the domain
	}
	
    lowerWall
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    symmetry
    {
		type        zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
